nykh/HearingAidProject/CCS/xbee/XBEE_reset/tm4c123gh6pm_startup_ccsValvano.c
//******************************************************************************
//
// This is the code that gets called when the processor receives an unexpected
// interrupt.  This simply enters an infinite loop, preserving the system state
// for examination by a debugger.
//
//******************************************************************************
static void MpuFault_Handler	(void){ while(1);}
static void BusFault_Handler	(void){ while(1);}
static void UsageFault_Handler 	(void){ while(1);}
static void SVC_Handler	      	(void){ while(1);}
static void DebugMon_Handler	(void){ while(1);}

//These Functions are all weakly defined, so the user can write over them in an external file
void PendSV_Handler            (void){ while(1);}
void SysTick_Handler           (void){ while(1);}
void GPIOPortA_Handler         (void){ while(1);}
void GPIOPortB_Handler         (void){ while(1);}
void GPIOPortC_Handler         (void){ while(1);}
void GPIOPortD_Handler         (void){ while(1);}
void GPIOPortE_Handler	       (void){ while(1);}
void UART0_Handler             (void){ while(1);}
void UART1_Handler             (void){ while(1);}
void SSI0_Handler              (void){ while(1);}
void I2C0_Handler              (void){ while(1);}
void PWM0Fault_Handler         (void){ while(1);}
void PWM0Gen0_Handler          (void){ while(1);}
void PWM0Gen1_Handler          (void){ while(1);}
void PWM0Gen2_Handler          (void){ while(1);}
void Quadrature0_Handler       (void){ while(1);}
void ADC0_Handler              (void){ while(1);}
void ADC1_Handler              (void){ while(1);}
void ADC2_Handler              (void){ while(1);}
void ADC3_Handler              (void){ while(1);}
void WDT_Handler               (void){ while(1);}
void Timer0A_Handler	       (void){ while(1);}
void Timer0B_Handler	       (void){ while(1);}
void Timer1A_Handler	       (void){ while(1);}
void Timer1B_Handler	       (void){ while(1);}
void Timer2A_Handler	       (void){ while(1);}
void Timer2B_Handler	       (void){ while(1);}
void Comp0_Handler             (void){ while(1);}
void Comp1_Handler             (void){ while(1);}
void Comp2_Handler             (void){ while(1);}
void SysCtl_Handle             (void){ while(1);}
void FlashCtl_Handler	       (void){ while(1);}
void GPIOPortF_Handler	       (void){ while(1);}
void UART2_Handler             (void){ while(1);}
void SSI1_Handler              (void){ while(1);}
void Timer3A_Handler	       (void){ while(1);}
void Timer3B_Handler	       (void){ while(1);}
void I2C1_Handler              (void){ while(1);}
void Quadrature1_Handler       (void){ while(1);}
void CAN0_Handler              (void){ while(1);}
void CAN1_Handler              (void){ while(1);}
void Hibernate_Handler	       (void){ while(1);}
void USB0_Handler              (void){ while(1);}
void PWM3_Handler              (void){ while(1);}
void uDMA_Handler              (void){ while(1);}
void uDMA_Error	               (void){ while(1);}
void ADC1Seq0_Handler          (void) { while(1);}
void ADC1Seq1_Handler          (void) { while(1);}
void ADC1Seq2_Handler          (void) { while(1);}
void ADC1Seq3_Handler          (void) { while(1);}
void SSI2_Handler              (void) { while(1);}
void SSI3_Handler              (void) { while(1);}
void UART3_Handler             (void) { while(1);}
void UART4_Handler             (void) { while(1);}
void UART5_Handler             (void) { while(1);}
void UART6_Handler             (void) { while(1);}
void UART7_Handler             (void) { while(1);}
void I2C2_Handler              (void) { while(1);}
void I2C3_Handler              (void) { while(1);}
void Timer4A_Handler           (void) { while(1);}
void Timer4B_Handler           (void) { while(1);}
void Timer5A_Handler           (void) { while(1);}
void Timer5B_Handler           (void) { while(1);}
void WideTimer0A_Handler       (void) { while(1);}
void WideTimer0B_Handler       (void) { while(1);}
void WideTimer1A_Handler       (void) { while(1);}
void WideTimer1B_Handler       (void) { while(1);}
void WideTimer2A_Handler       (void) { while(1);}
void WideTimer2B_Handler       (void) { while(1);}
void WideTimer3A_Handler       (void) { while(1);}
void WideTimer3B_Handler       (void) { while(1);}
void WideTimer4A_Handler       (void) { while(1);}
void WideTimer4B_Handler       (void) { while(1);}
void WideTimer5A_Handler       (void) { while(1);}
void WideTimer5B_Handler       (void) { while(1);}
void FPUException_Handler      (void) { while(1);}
void PWM1Gen0_Handler          (void) { while(1);}
void PWM1Gen1_Handler          (void) { while(1);}
void PWM1Gen2_Handler          (void) { while(1);}
void PWM1Gen3_Handler          (void) { while(1);}
void PWM1Fault_Handler         (void) { while(1);}

//******************************************************************************
//
// Useful functions.
//
//******************************************************************************
extern void  DisableInterrupts(void) ;
extern void  EnableInterrupts(void) ;
extern void  StartCritical(void) ;
extern void  EndCritical(void);
extern void  WaitForInterrupt (void);

//*********** DisableInterrupts ***************
// disable interrupts
// inputs:  none
// outputs: none
void DisableInterrupts(void){
	__asm ("    CPSID  I\n"
               "    BX     LR\n");
}

//*********** EnableInterrupts ***************
// emable interrupts
// inputs:  none
// outputs: none
void EnableInterrupts(void){
	__asm  ("    CPSIE  I\n"
                "    BX     LR\n");
}

//*********** StartCritical ************************
// make a copy of previous I bit, disable interrupts
// inputs:  none
// outputs: previous I bit
void StartCritical(void){
	__asm  ("    MRS    R0, PRIMASK  	; save old status \n"
                "    CPSID  I         	; mask all (except faults)\n"
                "    BX     LR\n");
}

//*********** EndCritical ************************
// using the copy of previous I bit, restore I bit to previous value
// inputs:  previous I bit
// outputs: none
void EndCritical(void){
	__asm  ("    MSR    PRIMASK, R0\n"
                "    BX     LR\n");
}

//*********** WaitForInterrupt ************************
// go to low power mode while waiting for the next interrupt
// inputs:  none
// outputs: none
void WaitForInterrupt(void){
	__asm  ("    WFI\n"
                "    BX     LR\n");
}

